src/Documents/ИнвентаризацияСклад/ИнвентаризацияСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияСклад</name>
  <comment>Аналог документа из ТШК 1С 7.7.</comment>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Технологический штрихкод (19 символов) или часть кода маркировки (первые 31 символ).</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>31</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЯчейкиКомплектовщиков</name>
    <comment>Нужно для восстановления значения текущей ячейки при выполнении инвентаризации.</comment>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИнвентаризацияСклад/ObjectModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура устанавливает номер ячейки для комплектовщика.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  НомерЯчейки - Строка
Процедура УстановитьНомерЯчейкиКомплектовщика(Знач Комплектовщик, Знач НомерЯчейки) Экспорт
                                            
    // 1. Поиск строки табличной части "ЯчейкиКомплектовщиков"
    ЯчейкиКомплектовщика = ЯчейкиКомплектовщиков.НайтиСтроки(Новый Структура("Комплектовщик", Комплектовщик));
    
    // 2.1. Запись документа, если нужно
    ТребуетсяЗаписать = Ложь;
    
    // 2.1. Обновление ячейки комплектовщика, если нужно
    Если ЯчейкиКомплектовщика.Количество() > 0 Тогда

        ЯчейкаКомплектовщика = ЯчейкиКомплектовщика[0];

        Если ЯчейкаКомплектовщика.НомерЯчейки <> НомерЯчейки Тогда

            ЯчейкаКомплектовщика.НомерЯчейки = НомерЯчейки;
            ТребуетсяЗаписать = Истина;

        КонецЕсли;
     
    // 2.2. Добавление ячейки комплектовщика   
    Иначе

        ЯчейкаКомплектовщика = ЯчейкиКомплектовщиков.Добавить();

        ЯчейкаКомплектовщика.Комплектовщик = Комплектовщик;
        ЯчейкаКомплектовщика.НомерЯчейки = НомерЯчейки;

        ТребуетсяЗаписать = Истина;

    КонецЕсли;    

    // 3. Запись документа, если нужно
    Если ТребуетсяЗаписать Тогда

        Записать();

    КонецЕсли;

КонецПроцедуры

// Процедура удаляет штрихкод из табличной части по номеру.
// 
// Параметры:
//  НомерШтрихкода - Число
Процедура УдалитьШтрихкод(Знач НомерШтрихкода) Экспорт

    Штрихкоды.Удалить(НомерШтрихкода - 1);

    Записать();

КонецПроцедуры

// Процедура удаляет все штрихкоды из табличной части с данным значением
// реквизита "Комплектовщик".
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//
// Возвращаемое значение:
//  Число - Количество удаленных штрихкодов
Функция УдалитьШтрихкодыКомплектовщика(Знач Комплектовщик) Экспорт

    КоличествоУдаленныхШтрихкодов = 0;

    ШтрихкодыКомплектовщика = Штрихкоды.НайтиСтроки(Новый Структура("Комплектовщик", Комплектовщик));

    Для Каждого ШтрихкодКомплектовщика Из ШтрихкодыКомплектовщика Цикл

        Штрихкоды.Удалить(ШтрихкодКомплектовщика.НомерСтроки - 1);

        КоличествоУдаленныхШтрихкодов = КоличествоУдаленныхШтрихкодов + 1;

    КонецЦикла;

    Записать();

    Возврат КоличествоУдаленныхШтрихкодов;

КонецФункции

#КонецОбласти
